{"AboutMe": "I am a results-driven Machine Learning Engineer and Data Scientist with a strong foundation in Computer Science and a minor in Psychology. My expertise spans across AI, ML, computer vision, and NLP, coupled with a holistic understanding of full-stack development. I thrive in leading and collaborating with diverse teams, managing client relationships, and delivering innovative, tailored AI solutions that align with business objectives. My strong analytical skills, strategic planning, and problem-solving abilities enable me to tackle complex challenges head-on. Adaptable and committed to continuous growth, I stay at the forefront of emerging technologies and industry trends, always ready to take on new challenges and opportunities.", "Contact": "Pakistan\n+92 300 2212940 \ntneeshat@outlook.com \nlinkedin.com/in/turyal-neeshat", "Education": "Bachelor of Science in Computer Science\nThe Lahore University of Management Sciences (LUMS) - Lahore, Pakistan\nSCGPA: 3.60 | CGPA: 3.47\nA- Levels / Highschool\nThe Lyceum School - Karachi, Pakistan\n3 A*s", "Experience": "\nMachine Learning Engineer\nXavor Corporation February 2023 - Present\nXavor Corporation, an IT and Health Tech company, focuses on innovative solutions in healthcare. As a key member of the R&D division and the AIaaS team, I contribute to product development and client-specific solutions.\nProduct Development & Innovation:\nSpearheaded the development and successful trials of the Navigait Fall Risk Assessment and Rehabilitation Station, and subsequently launched it in International markets. This Computer vision-based product helps healthcare providers assess and mitigate fall risks in elderly patients, improving patient safety and overall mobility.\nKey ML engineer in the Navigait Companion Care Robot project designed to assist in dementia care facilities, collaborating with the University of California, Irvine (UCI) to develop and deploy AI-powered modules. These included ML, LLM, and Computer Vision based solutions, all aimed at enhancing patient care and interaction in healthcare settings.\nClient Collaboration & Custom Solutions:\nCollaborated with international clients to deliver custom AI-powered solutions, focusing on Generative AI, including RAG (Retrieval-Augmented Generation) chatbots, and integrating NLP models for personalized communication.\nDesigned and implemented end-to-end ETL pipelines for efficient data processing and model training on Azure ML Studio, improving deployment times by 30%.\nDeveloped, trained, and deployed various data science solutions to analyze, extract insights, segment, and form predictions on the data based on the business requirements of the client.\nBuilt and delivered vision-based solutions for human activity recognition and sound classification models.\nMachine Learning Engineer\nXisys Consulting June 2022 – February 2023\nXisys Consulting specializes in security solutions and autonomous systems. I played a crucial role in advancing the company’s AI capabilities, particularly in security and video feed & drone technology.\nAutonomous Drone Systems:\nLed the development of multi-drone surveillance systems, focusing on real-time obstacle detection and avoidance systems using advanced Computer Vision techniques.\nBuilt a visual processing pipeline for drones to identify, and track objects in real- time, and then autonomously launch engagement drones for following.\nSecurity Solutions:\nDeveloped the human detection and monitoring system using live CCTV video feeds, enabling immediate identification, localization, and response to security threats.\nEnhanced the already existing multi-factor authentication identity management systems, incorporating Facial verification to ensure high security.\nImproved the real-time anomaly detection systems for Identity Management,\nusing activity logs and Deep Learning Solutions. Collaborative Projects:\nWorked closely with the product team to integrate Data Analytics solutions for in- house data to further the market reach.\nData Engineer\nTryp.com September 2021 – November 2021\nTryp.com, a Denmark-based startup, focuses on travel-related data solutions. I was responsible for optimizing and automating the company’s data infrastructure.\nData Pipeline Development:\nDesigned and implemented a fully automated data pipeline for large-scale data collection, processing, and storage, significantly reducing manual intervention. Utilized web scraping techniques to gather real-time data from various travel platforms, ensuring high data accuracy and completeness.\nCloud Deployment & Automation:\nDeployed the entire data pipeline on Heroku, ensuring scalability and reliability for continuous data ingestion and processing.\nUploaded the cleaned data to be fed forward to the AI Engines for processing.\nSoftware Engineer\nPharmaPlus Pakistan November 2020 – June 2022\nA healthcare technology company focused on delivering digital solutions for pharmacies. I was involved in mobile app development, website management, and database optimization.\nMobile Application Development:\nLed the end-to-end development of React Native-based mobile applications, from design to deployment, ensuring seamless user experience across both iOS and Android platforms.\nPublished and maintained apps on Google Play Store and Apple App Store, achieving over 10,000 downloads within the first six months.\nWeb Development & Backend Management:\nRevamped the company’s website to enhance overall user engagement and the backend infrastructure was restructured and upgraded to include RESTful APIs for the mobile application.\nOptimized database performance, reducing query execution time by 40%, ensuring efficient data handling for the company’s operations.\nCross-Functional Collaboration:\nCollaborated with the marketing and product teams to implement user feedback, leading to a 15% increase in app ratings and positive reviews.\nAchievements:\nSuccessfully launched multiple app updates that addressed critical user needs, contributing to a 25% increase in user retention and 75% in user acquisition. Enhanced website security and performance, ensuring compliance with industry standards.\n", "Expertise": "Artificial Intelligence Machine Learning Generative AI App Computer Vision RAG Chatbots\nData Science Data Analysis ETL Pipelines NLP & LLMs", "Skills": "Python, JavaScript, C++, Golang, Matlab\nML Libraries: Scikit-learn, PyTorch, TensorFlow, SpaCy, Langchains, Transformers, Hugging Face, LLMs, Llama.cpp, MMDetection, OpenCV Streamlit, Plotly, Matplotlib, Seaborn FastAPI, Flask, Express.js, Node.js\nHTML, CSS, Figma, React, PyQt5\nReact Native (iOS & Android)\nPinecone, ChromaDB, FAISS, LlamaIndex MySQL, SQLite, MongoDB, AWS RDS, S3, Azure Blob Storage\nAzure ML Studio, AWS, MLflow, GCP, Docker, Virtual Machines Selenium, Puppeteer, BeautifulSoup4", "Languages": "English C2 \nUrdu B2", "Research": "Towards Reproducible Ransomware Analysis\nCSET: Cyber Security Experimentation and Test 2023\nCo-authored research with Dr. Maneesh Yadav (SRI), Dr. Fareed Zaffar (LUMS), and Dr. Ashish Gehani (SRI) focused on analyzing ransomware malware and classifying it using machine learning techniques. The project led to the publication of preliminary findings and the creation of a publicly available ML-ready dataset for the cybersecurity community.\nhttps://doi.org/10.1145/3607505.3607510", "Extra Fields": {}}